html/this_page_is_designed_to_last.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-26 Thu 01:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>This Page is Designed to Last: A Manifesto for Preserving Content on the Web</title>
<meta name="author" content="Ketan Agrawal" />
<meta name="generator" content="Org Mode" />
<link rel="preload" href="syntax.css" as="style" onload="this.onload=null;this.rel='stylesheet'">
<noscript><link rel="stylesheet" href="syntax.css"></noscript>
<link rel="stylesheet" type="text/css" href="styles.css" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png" />
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png" />
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png" />
<link rel="manifest" href="/site.webmanifest" />
</head>
<body>
<div id="preamble" class="status">
<a style="color: inherit; text-decoration: none" href="/">
<h2>Ketan's Digital Laboratory &#129514;</h2>
</a>
</div>
<div id="content" class="content">
<h1 class="title">This Page is Designed to Last: A Manifesto for Preserving Content on the Web</h1>

<div id="outline-container-orgc9e64d1" class="outline-2">
<h2 id="orgc9e64d1">Is this site designed to last? <code>[71%]</code></h2>
<div class="outline-text-2" id="text-orgc9e64d1">
</div>
<div id="outline-container-orga861f34" class="outline-3">
<h3 id="orga861f34"><span class="done DONE">DONE</span> vanilla HTML/CSS</h3>
<div class="outline-text-3" id="text-orga861f34">
<p>
Yup. 100%. (static site generated from org files.) I usually try and check MDN to see if the CSS I'm using is kosher across browsers.<br />
</p>
</div>
</div>
<div id="outline-container-org3fcbf8a" class="outline-3">
<h3 id="org3fcbf8a"><span class="done DONE">DONE</span> Don't minimize HTML</h3>
<div class="outline-text-3" id="text-org3fcbf8a">
<p>
Yup.<br />
</p>
</div>
</div>
<div id="outline-container-org7653c6b" class="outline-3">
<h3 id="org7653c6b"><span class="todo TODO">TODO</span> prefer one page over several</h3>
<div class="outline-text-3" id="text-org7653c6b">
<p>
Well&#x2026;.that would kind of defeat the purpose of a digital garden. So I haven't really done this one.<br />
</p>
</div>
</div>
<div id="outline-container-orgfe48791" class="outline-3">
<h3 id="orgfe48791"><span class="done DONE">DONE</span> End all forms of hotlinking</h3>
<div class="outline-text-3" id="text-orgfe48791">
<p>
On the rare occasion I insert a <a href="mathematics.html#ID-7b8a4962-28ca-48e5-95a7-d347292a6dca">math</a> snippet, MathJax is used to render that, served from a Cloudflare CDN, as is default for org =&gt; html export. Also the occasional tweet embed. Other than that, downloaded all the necessary JS/CSS. (Minimal JS anyways; mainly used for tippy's).<br />
</p>
</div>
</div>
<div id="outline-container-org519ca26" class="outline-3">
<h3 id="org519ca26"><span class="done DONE">DONE</span> Stick with native fonts</h3>
<div class="outline-text-3" id="text-org519ca26">
<p>
Switched to a <a href="https://systemfontstack.com/">system font stack.</a><br />
</p>
</div>
</div>
<div id="outline-container-org6aee269" class="outline-3">
<h3 id="org6aee269"><span class="done DONE">DONE</span> Obsessively compress your images</h3>
<div class="outline-text-3" id="text-org6aee269">
<p>
I mean, I don't really have many images on the site right now, lol. I want to have more visual imagery though, so potentially I can come back to this later.<br />
</p>
</div>
</div>
<div id="outline-container-org6f0a805" class="outline-3">
<h3 id="org6f0a805"><span class="todo TODO">TODO</span> Eliminate broken URL risk</h3>
<div class="outline-text-3" id="text-org6f0a805">
<p>
Meh. I mean, hopefully I should be active enough with this website that I shouldn't have to care too much. That being said&#x2026;maybe I should think about this for future projects.<br />
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Made with <span class="heart">♥</span> using
<a href="https://orgmode.org/">org-mode</a>.
Source code is available
<a href="https://github.com/ketan0/digital-laboratory">here</a>.</p>
<script src="popper.min.js"></script>
<script src="tippy-bundle.umd.min.js"></script>
<script src="tooltips.js" async></script>
</div>
</body>
</html>
